{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "encoder.layers.21.mlp.fc2",
    "encoder.layers.21.mlp.fc1",
    "encoder.layers.23.mlp.fc2",
    "encoder.layers.23.mlp.fc1",
    "encoder.layers.23.self_attn.q_proj",
    "encoder.layers.22.self_attn.v_proj",
    "encoder.layers.23.self_attn.v_proj",
    "encoder.layers.21.self_attn.q_proj",
    "encoder.layers.22.self_attn.q_proj",
    "encoder.layers.22.mlp.fc2",
    "encoder.layers.19.mlp.fc1",
    "encoder.layers.20.mlp.fc1",
    "encoder.layers.20.self_attn.v_proj",
    "encoder.layers.19.self_attn.v_proj",
    "encoder.layers.20.mlp.fc2",
    "encoder.layers.20.self_attn.q_proj",
    "encoder.layers.19.self_attn.q_proj",
    "encoder.layers.21.self_attn.v_proj",
    "encoder.layers.22.mlp.fc1",
    "encoder.layers.19.mlp.fc2"
  ],
  "target_parameters": null,
  "task_type": "FEATURE_EXTRACTION",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}